src/InformationRegisters/ИсторияОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбменов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменов/Ext/ManagerModule.bsl
Функция ИсторияОбменовПоОбъекту(Ссылка, ВидОбмена = Неопределено) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИсторияОбменов.Период КАК Период,
	                      |	ИсторияОбменов.ВидОбмена КАК ВидОбмена,
	                      |	ИсторияОбменов.НомерПакета,
	                      |	ИсторияОбменов.Ссылка,
	                      |	ИсторияОбменов.Комментарий
	                      |ИЗ
	                      |	РегистрСведений.ИсторияОбменов КАК ИсторияОбменов
	                      |ГДЕ
	                      |	ИсторияОбменов.Ссылка = &Ссылка
	                      |	И (ИсторияОбменов.ВидОбмена = &ВидОбмена
	                      |			ИЛИ &ВидОбмена = НЕОПРЕДЕЛЕНО)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период
	                      |ИТОГИ ПО
	                      |	ВидОбмена");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидОбмена", ВидОбмена);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока Выборка.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("ВидОбмена");
		Область.Параметры.ВидОбмена = Выборка.ВидОбмена;
		ТабДок.Вывести(Область);
		ВыборкаДетальная = Выборка.Выбрать();
		ТабДок.НачатьГруппуСтрок();
		Пока ВыборкаДетальная.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаДетальная);
			ТабДок.Вывести(Область);
		КонецЦикла;
		ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
